---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.DirectContext3D.IDirectContext3DServer
source: html/a25c5d75-2547-6515-3d1d-7c266772bcf5.htm
---
# IDirectContext3DServer Members

Can be used to allow the server to execute only in certain views.